app/Http/Controllers/Front/CommentController.php

    public function makeComment(CommentRequest $request, Post $post)
    {
        $validated = $request->validated();

        $post->comments()->create([
            'user_id' => Auth::id(),
            'body' => $validated['body']
        ]);
---
insert into `comments` (`user_id`, `body`, `commentable_id`, `commentable_type`, `updated_at`, `created_at`) values (1, 'fsd', 8, 'App\Models\Post', '2025-04-02 14:51:42', '2025-04-02 14:51:42')