app/Http/Controllers/Front/DocumentController.php

    public function index()
    {
        $documents = Document::all();
---
select * from `documents`