app/Http/Controllers/Front/GalleryController.php

select * from `galleries`
---
    public function index()
    {
        $galleries = Gallery::all();