app/Http/Controllers/Admin/DocumentController.php

select * from `documents`
---
    public function index()
    {
        $documents = Document::all();