app/Http/Controllers/Admin/GalleryController.php

select * from `galleries` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `galleries`
---
    public function index()
    {
        $galleries = Gallery::latest()->paginate(15); // Change $images to $galleries