app/Http/Controllers/Admin/PageController.php

    public function index()
    {
        $pages = Page::with('user:id,name')->orderBy('id', 'desc')->paginate(15);
---
select * from `pages` order by `id` desc limit 15 offset 0
select `id`, `name` from `users` where `users`.`id` in (1)
select count(*) as aggregate from `pages`