app/Http/Controllers/Admin/PostController.php

    public function index()
    {
        $posts = Post::with(['category:id,name', 'user:id,name', 'tags:id,name'])->latest()->paginate(15);
---
select * from `posts` order by `created_at` desc limit 15 offset 0
select `id`, `name` from `categories` where `categories`.`id` in (1)
select `id`, `name` from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `posts`

    public function create()
    {
        $categories = Category::all();
        $tags = Tag::all();
---
select * from `categories`
select * from `tags`

    public function store(PostRequest $request)
    {
        $post_data = $request->safe()->except('image');

        if ($request->hasFile('image')) {
            $get_file = $request->file('image')->store('uploads', 'public');
            $post_data['image'] = $get_file;
        }

        $post = Post::create($post_data);
---
insert into `posts` (`title`, `content`, `category_id`, `slug`, `status`, `user_id`, `image`, `updated_at`, `created_at`) values ('acsjkajcn', '<p>jsvjndvjskvkjsdvbkjsdbvkjsdvbksjdbvjksdbvjksdvbjsdvbjksdvbjsdvbsjdvbskdjvsvsdvsndvskdvn</p><p>sdvnslkdvnsdkvsdvsdvsdv</p><p><img src=\"http://127.0.0.1:8000/uploads/posts/1743611227.jpg\" style=\"display: block; margin: auto; max-width: 100%; border: none; box-shadow: none;\"><br></p>', '1', 'vsdvsdv', '1', 2, 'uploads/mZfbGAQuJJnShOR1H9VAPA3fJFRUJqOEx8kC2lKr.jpg', '2025-04-02 16:27:15', '2025-04-02 16:27:15')